Revit 2024 API
BuiltInFailures.DocumentFailures.CannotAutoUpdate Property
 Coordination Monitor can't update element
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId CannotAutoUpdate { get; }
Visual Basic
Public Shared ReadOnly Property CannotAutoUpdate As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ CannotAutoUpdate {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.DocumentFailures Class
Autodesk.Revit.DB Namespace